Benchmark Automation/Sysbench/results/pcc-e2e-test/sysbench_run.log

============================================
Azure VM Benchmark Script
============================================
Total estimated runtime: ~60 minutes
Results will be saved to: ./benchmark_results/pcc-e2e-test_benchmark_20260106_200649.txt

============================================
Checking Dependencies
============================================
sysbench version: sysbench 1.0.20
============================================
Collecting System Information
============================================
========================================
BENCHMARK RESULTS
========================================

Hostname: pcc-e2e-test
Date: Tue Jan  6 20:06:49 UTC 2026
Kernel: 6.8.0-1044-azure

--- CPU Information ---
Architecture:                         x86_64
CPU(s):                               1
Model name:                           Intel(R) Xeon(R) CPU E5-2673 v4 @ 2.30GHz
Thread(s) per core:                   1
Core(s) per socket:                   1
Socket(s):                            1
CPU max MHz:                          2300.0000

--- Memory Information ---
               total        used        free      shared  buff/cache   available
Mem:           848Mi       241Mi        74Mi       3.0Mi       532Mi       455Mi
Swap:             0B          0B          0B

--- Disk Information ---
Filesystem      Size  Used Avail Use% Mounted on
/dev/root        29G   12G   17G  42% /

--- Azure VM Size (if available) ---
Standard_B1s
============================================
Running CPU Benchmark (1200s)
============================================
>>> Using 1 threads

========================================
CPU BENCHMARK
========================================
Threads: 1
Duration: 1200s

sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Prime numbers limit: 20000

Initializing worker threads...

Threads started!

CPU speed:
    events per second:   312.03

General statistics:
    total time:                          1200.0030s
    total number of events:              374442

Latency (ms):
         min:                                    2.11
         avg:                                    3.20
         max:                                   18.35
         95th percentile:                        4.25
         sum:                              1199551.20

Threads fairness:
    events (avg/stddev):           374442.0000/0.00
    execution time (avg/stddev):   1199.5512/0.00

============================================
Running Memory Benchmark (1200s)
============================================
>>> Using 1 threads

========================================
MEMORY BENCHMARK
========================================
Threads: 1
Duration: 1200s
Block size: 1K
Total size: 100G

--- Sequential Write ---
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Running memory speed test with the following options:
  block size: 1KiB
  total size: 102400MiB
  operation: write
  scope: global

Initializing worker threads...

Threads started!

Total operations: 104857600 (4193121.89 per second)

102400.00 MiB transferred (4094.85 MiB/sec)


General statistics:
    total time:                          25.0046s
    total number of events:              104857600

Latency (ms):
         min:                                    0.00
         avg:                                    0.00
         max:                                    8.30
         95th percentile:                        0.00
         sum:                                10792.74

Threads fairness:
    events (avg/stddev):           104857600.0000/0.00
    execution time (avg/stddev):   10.7927/0.00


--- Sequential Read ---
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Running memory speed test with the following options:
  block size: 1KiB
  total size: 102400MiB
  operation: read
  scope: global

Initializing worker threads...

Threads started!

Total operations: 104857600 (5142606.94 per second)

102400.00 MiB transferred (5022.08 MiB/sec)


General statistics:
    total time:                          20.3878s
    total number of events:              104857600

Latency (ms):
         min:                                    0.00
         avg:                                    0.00
         max:                                    5.01
         95th percentile:                        0.00
         sum:                                 6429.12

Threads fairness:
    events (avg/stddev):           104857600.0000/0.00
    execution time (avg/stddev):   6.4291/0.00


--- Random Write ---
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Running memory speed test with the following options:
  block size: 1KiB
  total size: 102400MiB
  operation: write
  scope: global

Initializing worker threads...

Threads started!

Total operations: 104857600 (1338829.32 per second)

102400.00 MiB transferred (1307.45 MiB/sec)


General statistics:
    total time:                          78.3182s
    total number of events:              104857600

Latency (ms):
         min:                                    0.00
         avg:                                    0.00
         max:                                   14.00
         95th percentile:                        0.00
         sum:                                64369.29

Threads fairness:
    events (avg/stddev):           104857600.0000/0.00
    execution time (avg/stddev):   64.3693/0.00


--- Random Read ---
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Running memory speed test with the following options:
  block size: 1KiB
  total size: 102400MiB
  operation: read
  scope: global

Initializing worker threads...

Threads started!

Total operations: 104857600 (1333659.70 per second)

102400.00 MiB transferred (1302.40 MiB/sec)


General statistics:
    total time:                          78.6218s
    total number of events:              104857600

Latency (ms):
         min:                                    0.00
         avg:                                    0.00
         max:                                   11.96
         95th percentile:                        0.00
         sum:                                64687.43

Threads fairness:
    events (avg/stddev):           104857600.0000/0.00
    execution time (avg/stddev):   64.6874/0.00

============================================
Running I/O Benchmark (1200s)
============================================
>>> Using 1 threads
>>> Creating test files (10G)...
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

128 files, 81920Kb each, 10240Mb total
Creating files for the test...
Extra file open flags: (none)
Reusing existing file test_file.0
Reusing existing file test_file.1
Reusing existing file test_file.2
Reusing existing file test_file.3
Reusing existing file test_file.4
Reusing existing file test_file.5
Reusing existing file test_file.6
Reusing existing file test_file.7
Reusing existing file test_file.8
Reusing existing file test_file.9
Reusing existing file test_file.10
Reusing existing file test_file.11
Reusing existing file test_file.12
Reusing existing file test_file.13
Reusing existing file test_file.14
Reusing existing file test_file.15
Reusing existing file test_file.16
Reusing existing file test_file.17
Reusing existing file test_file.18
Reusing existing file test_file.19
Reusing existing file test_file.20
Reusing existing file test_file.21
Reusing existing file test_file.22
Reusing existing file test_file.23
Reusing existing file test_file.24
Reusing existing file test_file.25
Reusing existing file test_file.26
Reusing existing file test_file.27
Reusing existing file test_file.28
Reusing existing file test_file.29
Reusing existing file test_file.30
Reusing existing file test_file.31
Reusing existing file test_file.32
Reusing existing file test_file.33
Reusing existing file test_file.34
Reusing existing file test_file.35
Reusing existing file test_file.36
Reusing existing file test_file.37
Reusing existing file test_file.38
Reusing existing file test_file.39
Reusing existing file test_file.40
Reusing existing file test_file.41
Reusing existing file test_file.42
Reusing existing file test_file.43
Reusing existing file test_file.44
Reusing existing file test_file.45
Reusing existing file test_file.46
Reusing existing file test_file.47
Reusing existing file test_file.48
Reusing existing file test_file.49
Reusing existing file test_file.50
Reusing existing file test_file.51
Reusing existing file test_file.52
Reusing existing file test_file.53
Reusing existing file test_file.54
Reusing existing file test_file.55
Reusing existing file test_file.56
Reusing existing file test_file.57
Reusing existing file test_file.58
Reusing existing file test_file.59
Reusing existing file test_file.60
Reusing existing file test_file.61
Reusing existing file test_file.62
Reusing existing file test_file.63
Reusing existing file test_file.64
Reusing existing file test_file.65
Reusing existing file test_file.66
Reusing existing file test_file.67
Reusing existing file test_file.68
Reusing existing file test_file.69
Reusing existing file test_file.70
Reusing existing file test_file.71
Reusing existing file test_file.72
Reusing existing file test_file.73
Reusing existing file test_file.74
Reusing existing file test_file.75
Reusing existing file test_file.76
Reusing existing file test_file.77
Reusing existing file test_file.78
Reusing existing file test_file.79
Reusing existing file test_file.80
Reusing existing file test_file.81
Reusing existing file test_file.82
Reusing existing file test_file.83
Reusing existing file test_file.84
Reusing existing file test_file.85
Reusing existing file test_file.86
Reusing existing file test_file.87
Reusing existing file test_file.88
Reusing existing file test_file.89
Reusing existing file test_file.90
Reusing existing file test_file.91
Reusing existing file test_file.92
Reusing existing file test_file.93
Reusing existing file test_file.94
Reusing existing file test_file.95
Reusing existing file test_file.96
Extending existing file test_file.97
Creating file test_file.98
Creating file test_file.99
Creating file test_file.100
Creating file test_file.101
Creating file test_file.102
Creating file test_file.103
Creating file test_file.104
Creating file test_file.105
Creating file test_file.106
Creating file test_file.107
Creating file test_file.108
Creating file test_file.109
Creating file test_file.110
Creating file test_file.111
Creating file test_file.112
Creating file test_file.113
Creating file test_file.114
Creating file test_file.115
Creating file test_file.116
Creating file test_file.117
Creating file test_file.118
Creating file test_file.119
Creating file test_file.120
Creating file test_file.121
Creating file test_file.122
Creating file test_file.123
Creating file test_file.124
Creating file test_file.125
Creating file test_file.126
Creating file test_file.127
2529034240 bytes written in 45.01 seconds (53.58 MiB/sec).
tee: ./benchmark_results/pcc-e2e-test_benchmark_20260106_200649.txt: No such file or directory

========================================
I/O BENCHMARK
========================================
Threads: 1
Duration: 1200s
File size: 10G

--- Sequential Read ---
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 80MiB each
10GiB total file size
Block size 16KiB
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing sequential read test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      3418.64
    writes/s:                     0.00
    fsyncs/s:                     0.00

Throughput:
    read, MiB/s:                  53.42
    written, MiB/s:               0.00

General statistics:
    total time:                          300.0208s
    total number of events:              1025671

Latency (ms):
         min:                                    0.00
         avg:                                    0.29
         max:                                   71.65
         95th percentile:                        0.56
         sum:                               299427.27

Threads fairness:
    events (avg/stddev):           1025671.0000/0.00
    execution time (avg/stddev):   299.4273/0.00


--- Sequential Write ---
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 80MiB each
10GiB total file size
Block size 16KiB
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing sequential write (creation) test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      0.00
    writes/s:                     1776.34
    fsyncs/s:                     2273.85

Throughput:
    read, MiB/s:                  0.00
    written, MiB/s:               27.76

General statistics:
    total time:                          300.0527s
    total number of events:              1215150

Latency (ms):
         min:                                    0.01
         avg:                                    0.25
         max:                                 1991.09
         95th percentile:                        0.77
         sum:                               298956.44

Threads fairness:
    events (avg/stddev):           1215150.0000/0.00
    execution time (avg/stddev):   298.9564/0.00


--- Random Read ---
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 80MiB each
10GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random read test
FATAL: Size of file 'test_file.104' is 8.125MiB, but at least 80MiB is expected.
WARNING: Did you run 'prepare' with different --file-total-size or --file-num values?